//-------------------------------------------------------------------
// 2024 1학기 STL 화56목56		5월 28일 화요일		(13주 1)
// 
// Unordered Associative Container - unordered_set / unordered_map
// - 순서가 없다
// - 메모리를 어떻게 사용하여 복잡도가 O(1)인가
// - 내가 만든 String을 저장하려면 어떻게
// 
// 6월 6일 목요일 - 강의하겠습니다.
// 6월 13일 목요일 (15주 2일) - 기말시험
//-------------------------------------------------------------------
#include <iostream>
#include "save.h"
#include "String.h"

extern bool 관찰;

//-------------
int main(void)
//-------------
{
	save("STL.cpp");
}